results/2018-05-05_17-05-42/simple-get/aleph-server.out
Running 180m test @ http://127.0.0.1:3000/
  3 threads and 500 connections
  Thread calibration: mean lat.: 0.943ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.953ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.945ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.98ms  424.79us  18.70ms   67.00%
    Req/Sec   172.28     92.99   666.00     73.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.28ms
 90.000%    1.46ms
 99.000%    2.01ms
 99.900%    2.22ms
 99.990%    2.44ms
 99.999%   10.43ms
100.000%   18.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.144     0.000000            1         1.00
       0.377     0.100000       539978         1.11
       0.563     0.200000      1080413         1.25
       0.737     0.300000      1619252         1.43
       0.890     0.400000      2160857         1.67
       1.019     0.500000      2701303         2.00
       1.075     0.550000      2968286         2.22
       1.128     0.600000      3240455         2.50
       1.179     0.650000      3509539         2.86
       1.230     0.700000      3779127         3.33
       1.282     0.750000      4046343         4.00
       1.309     0.775000      4184385         4.44
       1.335     0.800000      4315911         5.00
       1.362     0.825000      4452972         5.71
       1.389     0.850000      4587444         6.67
       1.419     0.875000      4721644         8.00
       1.438     0.887500      4787960         8.89
       1.463     0.900000      4856689        10.00
       1.497     0.912500      4924084        11.43
       1.544     0.925000      4990017        13.33
       1.602     0.937500      5057746        16.00
       1.633     0.943750      5091750        17.78
       1.665     0.950000      5125349        20.00
       1.701     0.956250      5159280        22.86
       1.742     0.962500      5192448        26.67
       1.789     0.968750      5226137        32.00
       1.815     0.971875      5242853        35.56
       1.842     0.975000      5259836        40.00
       1.871     0.978125      5276800        45.71
       1.902     0.981250      5293786        53.33
       1.936     0.984375      5310486        64.00
       1.954     0.985938      5318701        71.11
       1.974     0.987500      5327528        80.00
       1.994     0.989062      5335653        91.43
       2.016     0.990625      5344353       106.67
       2.039     0.992188      5352693       128.00
       2.051     0.992969      5356667       142.22
       2.065     0.993750      5360915       160.00
       2.081     0.994531      5365332       182.86
       2.097     0.995313      5369286       213.33
       2.117     0.996094      5373746       256.00
       2.127     0.996484      5375812       284.44
       2.137     0.996875      5377781       320.00
       2.149     0.997266      5379963       365.71
       2.161     0.997656      5381965       426.67
       2.175     0.998047      5384084       512.00
       2.183     0.998242      5385105       568.89
       2.193     0.998437      5386277       640.00
       2.203     0.998633      5387380       731.43
       2.213     0.998828      5388346       853.33
       2.225     0.999023      5389388      1024.00
       2.231     0.999121      5389832      1137.78
       2.239     0.999219      5390379      1280.00
       2.249     0.999316      5390980      1462.86
       2.259     0.999414      5391473      1706.67
       2.271     0.999512      5391970      2048.00
       2.279     0.999561      5392249      2275.56
       2.287     0.999609      5392471      2560.00
       2.299     0.999658      5392759      2925.71
       2.309     0.999707      5392994      3413.33
       2.323     0.999756      5393256      4096.00
       2.333     0.999780      5393396      4551.11
       2.343     0.999805      5393510      5120.00
       2.359     0.999829      5393649      5851.43
       2.379     0.999854      5393778      6826.67
       2.407     0.999878      5393908      8192.00
       2.421     0.999890      5393968      9102.22
       2.441     0.999902      5394036     10240.00
       2.465     0.999915      5394100     11702.86
       2.503     0.999927      5394165     13653.33
       2.567     0.999939      5394231     16384.00
       2.663     0.999945      5394264     18204.44
       3.035     0.999951      5394297     20480.00
       3.651     0.999957      5394330     23405.71
       4.167     0.999963      5394363     27306.67
       4.539     0.999969      5394396     32768.00
       4.851     0.999973      5394412     36408.89
       5.215     0.999976      5394429     40960.00
       5.407     0.999979      5394445     46811.43
       5.743     0.999982      5394462     54613.33
       6.639     0.999985      5394478     65536.00
       7.531     0.999986      5394486     72817.78
       9.495     0.999988      5394495     81920.00
      10.207     0.999989      5394503     93622.86
      10.999     0.999991      5394511    109226.67
      11.431     0.999992      5394519    131072.00
      11.727     0.999993      5394524    145635.56
      12.383     0.999994      5394528    163840.00
      13.903     0.999995      5394532    187245.71
      14.391     0.999995      5394536    218453.33
      15.199     0.999996      5394540    262144.00
      15.311     0.999997      5394542    291271.11
      15.391     0.999997      5394544    327680.00
      15.679     0.999997      5394546    374491.43
      15.767     0.999998      5394548    436906.67
      15.935     0.999998      5394550    524288.00
      15.975     0.999998      5394551    582542.22
      16.111     0.999998      5394552    655360.00
      16.191     0.999999      5394553    748982.86
      16.327     0.999999      5394554    873813.33
      16.415     0.999999      5394555   1048576.00
      16.479     0.999999      5394556   1165084.44
      16.479     0.999999      5394556   1310720.00
      16.799     0.999999      5394557   1497965.71
      16.799     0.999999      5394557   1747626.67
      16.927     1.000000      5394558   2097152.00
      16.927     1.000000      5394558   2330168.89
      16.927     1.000000      5394558   2621440.00
      17.023     1.000000      5394559   2995931.43
      17.023     1.000000      5394559   3495253.33
      17.023     1.000000      5394559   4194304.00
      17.023     1.000000      5394559   4660337.78
      17.023     1.000000      5394559   5242880.00
      18.719     1.000000      5394560   5991862.86
      18.719     1.000000      5394560          inf
#[Mean    =        0.982, StdDeviation   =        0.425]
#[Max     =       18.704, Total count    =      5394560]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5400041 requests in 180.00m, 659.18MB read
Requests/sec:    500.00
Transfer/sec:     62.50KB