results/2018-05-05_17-05-42/simple-get/httpkit-server.out
Running 180m test @ http://127.0.0.1:3000/
  3 threads and 500 connections
  Thread calibration: mean lat.: 0.939ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.936ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.945ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96ms  428.32us   7.90ms   66.97%
    Req/Sec   172.41     95.35   666.00     73.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.00ms
 75.000%    1.26ms
 90.000%    1.43ms
 99.000%    2.00ms
 99.900%    2.20ms
 99.990%    2.35ms
 99.999%    3.82ms
100.000%    7.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.140     0.000000           26         1.00
       0.336     0.100000       541053         1.11
       0.524     0.200000      1079743         1.25
       0.709     0.300000      1621178         1.43
       0.871     0.400000      2159487         1.67
       1.005     0.500000      2701327         2.00
       1.060     0.550000      2971746         2.22
       1.111     0.600000      3237608         2.50
       1.162     0.650000      3511588         2.86
       1.211     0.700000      3780082         3.33
       1.260     0.750000      4049516         4.00
       1.285     0.775000      4184829         4.44
       1.310     0.800000      4318947         5.00
       1.336     0.825000      4454813         5.71
       1.362     0.850000      4588398         6.67
       1.391     0.875000      4722438         8.00
       1.410     0.887500      4790754         8.89
       1.434     0.900000      4856670        10.00
       1.468     0.912500      4923254        11.43
       1.515     0.925000      4990689        13.33
       1.574     0.937500      5058017        16.00
       1.608     0.943750      5091865        17.78
       1.645     0.950000      5125611        20.00
       1.685     0.956250      5158661        22.86
       1.730     0.962500      5192647        26.67
       1.778     0.968750      5226140        32.00
       1.804     0.971875      5242915        35.56
       1.832     0.975000      5260078        40.00
       1.861     0.978125      5276677        45.71
       1.893     0.981250      5293843        53.33
       1.926     0.984375      5310448        64.00
       1.944     0.985938      5318891        71.11
       1.963     0.987500      5327242        80.00
       1.985     0.989062      5335930        91.43
       2.008     0.990625      5344155       106.67
       2.034     0.992188      5352575       128.00
       2.049     0.992969      5357115       142.22
       2.063     0.993750      5361043       160.00
       2.079     0.994531      5365246       182.86
       2.095     0.995313      5369461       213.33
       2.111     0.996094      5373498       256.00
       2.121     0.996484      5375858       284.44
       2.131     0.996875      5377944       320.00
       2.141     0.997266      5380024       365.71
       2.151     0.997656      5381991       426.67
       2.163     0.998047      5384077       512.00
       2.171     0.998242      5385385       568.89
       2.177     0.998437      5386289       640.00
       2.185     0.998633      5387400       731.43
       2.193     0.998828      5388373       853.33
       2.203     0.999023      5389313      1024.00
       2.211     0.999121      5389993      1137.78
       2.217     0.999219      5390461      1280.00
       2.223     0.999316      5390898      1462.86
       2.231     0.999414      5391407      1706.67
       2.241     0.999512      5391989      2048.00
       2.245     0.999561      5392203      2275.56
       2.251     0.999609      5392461      2560.00
       2.259     0.999658      5392734      2925.71
       2.269     0.999707      5393008      3413.33
       2.281     0.999756      5393265      4096.00
       2.287     0.999780      5393383      4551.11
       2.295     0.999805      5393525      5120.00
       2.305     0.999829      5393662      5851.43
       2.315     0.999854      5393780      6826.67
       2.329     0.999878      5393909      8192.00
       2.339     0.999890      5393971      9102.22
       2.351     0.999902      5394041     10240.00
       2.363     0.999915      5394103     11702.86
       2.379     0.999927      5394163     13653.33
       2.401     0.999939      5394233     16384.00
       2.417     0.999945      5394264     18204.44
       2.437     0.999951      5394297     20480.00
       2.463     0.999957      5394328     23405.71
       2.589     0.999963      5394361     27306.67
       2.981     0.999969      5394395     32768.00
       3.125     0.999973      5394411     36408.89
       3.249     0.999976      5394427     40960.00
       3.371     0.999979      5394443     46811.43
       3.517     0.999982      5394460     54613.33
       3.625     0.999985      5394476     65536.00
       3.675     0.999986      5394484     72817.78
       3.741     0.999988      5394493     81920.00
       3.815     0.999989      5394501     93622.86
       3.859     0.999991      5394509    109226.67
       3.945     0.999992      5394517    131072.00
       4.055     0.999993      5394521    145635.56
       4.123     0.999994      5394526    163840.00
       4.159     0.999995      5394530    187245.71
       4.223     0.999995      5394534    218453.33
       4.279     0.999996      5394538    262144.00
       4.331     0.999997      5394540    291271.11
       4.371     0.999997      5394542    327680.00
       4.507     0.999997      5394544    374491.43
       4.623     0.999998      5394546    436906.67
       4.771     0.999998      5394548    524288.00
       4.895     0.999998      5394549    582542.22
       4.915     0.999998      5394550    655360.00
       4.935     0.999999      5394551    748982.86
       4.951     0.999999      5394552    873813.33
       4.995     0.999999      5394553   1048576.00
       5.135     0.999999      5394554   1165084.44
       5.135     0.999999      5394554   1310720.00
       5.167     0.999999      5394555   1497965.71
       5.167     0.999999      5394555   1747626.67
       5.299     1.000000      5394556   2097152.00
       5.299     1.000000      5394556   2330168.89
       5.299     1.000000      5394556   2621440.00
       5.335     1.000000      5394557   2995931.43
       5.335     1.000000      5394557   3495253.33
       5.335     1.000000      5394557   4194304.00
       5.335     1.000000      5394557   4660337.78
       5.335     1.000000      5394557   5242880.00
       7.907     1.000000      5394558   5991862.86
       7.907     1.000000      5394558          inf
#[Mean    =        0.956, StdDeviation   =        0.428]
#[Max     =        7.904, Total count    =      5394558]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5400039 requests in 180.00m, 520.14MB read
Requests/sec:    500.00
Transfer/sec:     49.32KB